{
    "Filters": [
        {
            "filterName": "Class",
            "filterDesc": "A class in programming languages serves as a blueprint or template for creating objects, which are instances of that class."
        },
        {
            "filterName": "Function",
            "filterDesc": "A function in programming languages is a self-contained block of code that performs a specific task that are executed when it is called."
        },
        {
            "filterName": "Variable",
            "filterDesc": "A variable in programming languages is a named storage location used to hold data that can change during the execution of a program."
        },
        {
            "filterName": "If-Else Conditional",
            "filterDesc": "An if-Else conditional in programming languages is a control flow statement based on whether a condition is true or false."
        },
        {
            "filterName": "Switch Case Conditional",
            "filterDesc": "A switch-case conditional in programming languages is a control flow statement based on the value of a variable."
        },
        {
            "filterName": "For Loop",
            "filterDesc": "A loop in programming languages is a control flow statement that allows to execute a block of code multiple times."
        },
        {
            "filterName": "While Loop",
            "filterDesc": "A while loop in programming languages is a control flow statement that allows to execute a code block while checking a condition."
        }
    ],
    "Playgrounds": [
        {
            "playgroundId": "Class",
            "playgroundDesc": "A Class is a fundamental concept in object-oriented programming (OOP). It serves as a blueprint or template for creating objects. A class encapsulates data for the object (attributes or properties) and functions (methods) that operate on the data."
        },
        {
            "playgroundId": "Function",
            "playgroundDesc": "A function is a self-contained block of code that performs a specific task."
        },
        {
            "playgroundId": "Variable",
            "playgroundDesc": "A variable is a named storage location used to hold data that can change during the execution of a program."
        },
        {
            "playgroundId": "If-Else Conditional",
            "playgroundDesc": "An if-else conditional in programming languages is a control flow statement that allows you to execute different code blocks based on whether a condition is true or false."
        },
        {
            "playgroundId": "Switch Case Conditional",
            "playgroundDesc": "A switch-case conditional in programming languages is a control flow statement that allows a variable to be tested against a list of values, each with an associated block of code to execute."
        },
        {
            "playgroundId": "For Loop",
            "playgroundDesc": "A for loop in programming languages is a control flow statement used to repeatedly execute a block of code a certain number of times or over a sequence of values."
        },
        {
            "playgroundId": "While Loop",
            "playgroundDesc": "A while loop in programming languages is is a control flow statement that allows code to be executed repeatedly based on a given Boolean condition"
        }
    ],
    "Languages": [
        {
            "languageName": "C++"
        },
        {
            "languageName": "C#"
        },
        {
            "languageName": "JavaScript"
        },
        {
            "languageName": "Python"
        },
        {
            "languageName": "Ruby"
        },
        {
            "languageName": "Java"
        },
        {
            "languageName": "Swift"
        },
        {
            "languageName": "Go"
        },
        {
            "languageName": "TypeScript"
        },
        {
            "languageName": "PHP"
        }
    ]
}